/* Task 3: Полагане на плочки
В една сграда с под с размери n х m трябва да се положат плочки с размер a х a. 
Позволено е плочките да покриват повече от площта на пода.

По дадени n, m и а определете минималния брой плочки, който е нужен.


Вход: 6 6 4

Изход: 4

*/
#include <iostream>
#include <cmath>
using namespace std;
int main()
{	
	// Размерите са цели числа
	int n,m,a;
	
	// Да ги прочетем
	cin >> n >> m >> a;
	
	// Да видим колко пъти по дължина и ширина плочките се събират в пода
	// ceil() закръгля едно дробно число нагоре до цяло число
	// т.е. ceil(2.1) == 3
	// така, ако за един ред или колона ни трябват 4.2 плочки по сметка, ние ще вземем 5
	// използваме (double) пред n за да получим резултат реално число като 4.2, а не 4
	int length = ceil((double)n/a);
	int width = ceil((double)m/a);
	
	// Отговорът ще е броя плочки по дължина по броя плочки по ширина
	int ans = length * width;
	
	// Изкарваме отговора и нов ред
	cout<< ans<<endl;
	
	return 0;
}