#include<iostream>
using namespace std;
int main()
{
	// Във qx и qy ще пишем реда и колоната на царицата,
	// а в a и b ще пишем реда и колоната на полето, което ни интересува.
	int qx ,qy ,a, b;
	
	cin>>qx>>qy>>a>>b;
	
	/// Царицата бие като топ и офицер.
	/// Нека да напишем по един булев израз за топа и за офицера и да ги запазим в една променлива
	
	// Истина, ако са на един и същи ред, или на една и съща колона
	bool rook = (qx==a) || (qy==b);
	
	// ПИТАЙТЕ ЗА РАЗЯСНЕНИЯ
	bool bishop = (qx-qy) == (a-b) || (qx+qy) == (a+b);
	
	
	// Ако бие полето като топ или го бие като офицер
	if(rook || bishop)
	{
		cout<<"YES"<<endl;
	}
	else
	{
		cout<<"NO"<<endl;
	}
	return 0;
}