#include <iostream>
using namespace std;
int main()
{
    // По условие матриците може да са най-много 100 х 100.
    const int MAX_N = 100,MAX_M = 100;
    
    // Да си направим три матрици - A1 и A2 ще съдържат входните матрици, а A1xA2 ще съдържа произведението им.
    int A1[MAX_N][MAX_M],A2[MAX_N][MAX_M], A1xA2[MAX_N][MAX_M];
    
    // Нека размерите на първата матрица да ги държим в A1n и A1m, а размерите на втората - в A2n и A2m.
    // Това ще са съответно броя редове и броя колони на матриците
    int A1n, A1m, A2n, A2m;
    
    // Да прочетем колко реда и колко стълба има A1.
    cin>>A1n>>A1m;
    
    // Да прочетем A1.
    for(int i = 0; i < A1n; i++)
    {
        for(int j = 0; j < A1m; j++)
        {
            cin>>A1[i][j];
        }
    }
    
    // Да прочетем колко реда и колко стълба има A2.
    cin>>A2n>>A2m;
    
    // Да прочетем A2.
    for(int i = 0; i < A2n; i++)
    {
        for(int j = 0; j < A2m; j++)
        {
            cin>>A2[i][j];
        }
    }
    
    
    // Матрици се умножават като се вземе един ред i от първата матрица и един ред j от втората матрица, 
    // първия елемент от реда се умножава с първия елемент от колоната, втория от реда се умножава с втория от колоната, и така нататък докато свършат елементите,
    // и накрая всичките произведения се събират, и сбора се пише в новата матрица на i-ти ред и j-та колона.
    
    // Това ще означава, че броя колони на първата(броя елементи на всеки ред) трябва да е равен на броя редове на втората(броя елементи във всяка колона),
    // за да може да "оженим" всички числа.
    if(A1m == A2n)
    {
        cout<<"YES"<<endl;
        
        for(int i = 0; i < A1n; i++)
        {
            for(int j = 0; j < A2m; j++)
            {
                // Сега ще ходим по i-тия ред на първата матрица и по j-тата колона на втората матрица и ще ги умножим и съберем в една временна променлива.
                int result = 0;
                
                for(int k = 0 ;k < A1m; k++)
                {
                    result += A1[i][k]*A2[k][j];
                }
                
                // Да запишем сбора от произведенията на елементите на i-тия ред и j-тата колона в матрицата.
                A1xA2[i][j] = result;
            }
        }
    }
    
    // Да принтираме новата матрица, която ще е с размери A1n х A2m
    for(int i = 0; i < A1n; i++)
    {
        for(int j = 0; j < A2m;j++)
        {
            cout<<A1xA2[i][j]<<" ";
        }
        cout<<endl;
    }
    
    
    return 0;
}
